src/cf/Catalogs/Описания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Описания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВерсииФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСвойстваОбъектовВИсходномПорядке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОформлениеЗаголовков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбразецОформления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СкрытыеОбъектыФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СкрытыеОбъектыФормата</Name>
			<Comment>Объекты формата которые не показываются в списке Объекты без описания</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Описания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектОписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыФормата</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементыОписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыФормата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыЭлементовОписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовОписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОписаниеОбъектаФормата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заголовок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Типы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыОбщихРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОбщихРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщаяТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаОбщихСвойств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючевыеСвойства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ЭлементыОписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ЭлементыОписания</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Описания</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПростогоОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОписаниеСвойствОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОписаниеГруппСвойств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОписанияРеквизитовШапки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственноеОписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияРеквизитовТабличнойЧасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственноеОписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияТипов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыФормата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПространствоИмен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияПростыхТипов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Описания/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстОписания = Объект.Ссылка.ЗаголовокОписания.Получить();
		
		// Образцы заголовков
		Для Каждого СтрокаОформление Из Объект.Ссылка.ОформлениеЗаголовков Цикл
			ТекУровень = СтрокаОформление.Уровень;
			Если ТекУровень > 0 И ТекУровень <= 6 Тогда
				Если ТекУровень = 1 Тогда
					Заголовок1 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 2 Тогда
					Заголовок2 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 3 Тогда
					Заголовок3 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 4 Тогда
					Заголовок4 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 5 Тогда
					Заголовок5 = СтрокаОформление.ОбразецОформления.Получить();
				ИначеЕсли ТекУровень = 6 Тогда
					Заголовок6 = СтрокаОформление.ОбразецОформления.Получить();
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Наименование
	|ИЗ Справочник.ВерсииФормата";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаВерсииФормата = РезультатЗапроса.Выбрать();
	Пока ВыборкаВерсииФормата.Следующий() Цикл
		Элементы.НомерВерсииФормата.СписокВыбора.Добавить(ВыборкаВерсииФормата.Наименование);
	КонецЦикла;
	Элементы.ОбъектыБезОписанияОтборСправочники.Пометка = Ложь;
	Элементы.ОбъектыБезОписанияОтборДокументы.Пометка = Ложь;
	Элементы.ОбъектыБезОписанияПоказатьСкрытыеВСписке.Пометка = Ложь;
	Элементы.ГруппаСтраницыРезультата.ТекущаяСтраница = Элементы.ГруппаРезультатОсновная;
	ИскатьЭлементыОписанийБезЗаголовков = Истина;
	Элементы.ОбъектыБезОписанияИскатьЭлементыОписанийБезЗаголовков.Пометка = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ХранилищеФорматированногоДокумента = Новый ХранилищеЗначения(ТекстОписания);
	ТекущийОбъект.ЗаголовокОписания = ХранилищеФорматированногоДокумента;
	
	ТекущийОбъект.ОформлениеЗаголовков.Очистить();
	Для НомерЗаголовка=1 По 6 Цикл
		Если НомерЗаголовка = 1 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок1);
		ИначеЕсли НомерЗаголовка = 2 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок2);
		ИначеЕсли НомерЗаголовка = 3 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок3);
		ИначеЕсли НомерЗаголовка = 4 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок4);
		ИначеЕсли НомерЗаголовка = 5 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок5);
		ИначеЕсли НомерЗаголовка = 6 Тогда
			ХранилищеФД = Новый ХранилищеЗначения(Заголовок6);
		КонецЕсли;
		НовСтрока = ТекущийОбъект.ОформлениеЗаголовков.Добавить();
		НовСтрока.Уровень = НомерЗаголовка;
		НовСтрока.ОбразецОформления = ХранилищеФД;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписанЭлементОписания" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		ОбработатьЗаписьЭлементаОписания(Параметр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОбъектыБезОписанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСсылка = Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка;
	ТекПроблема = Элементы.ОбъектыБезОписания.ТекущиеДанные.Проблема;
	Если ТипЗнч(ТекСсылка) = Тип("СправочникСсылка.ОбъектыФормата") Тогда
		// Надо создать новый элемент описания
		ПараметрыВр = Новый Структура("ОбъектФормата, Владелец, РежимРаботыМастера", Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка, Объект.Ссылка, Истина);
		ОткрытьФорму("Справочник.ЭлементыОписания.ФормаОбъекта", ПараметрыВр, ЭтаФорма);
	ИначеЕсли ТипЗнч(ТекСсылка) = Тип("СправочникСсылка.ТипыФормата") Тогда
		// Надо изменить существующий элемент с типом или создать новый если такого нет.
		СсылкаЭлементОписания = НайтиЭлементОписанияДляТипов();
		Если СсылкаЭлементОписания = Неопределено Тогда
			ПараметрыВр = Новый Структура("ТипЭлемента, Владелец, РежимРаботыМастера", ПредопределенноеЗначение("Перечисление.ТипыЭлементовОписания.Типы"), Объект.Ссылка, Ложь);
		Иначе
			ПараметрыВр = Новый Структура("Ключ, РежимРаботыМастера", СсылкаЭлементОписания, Ложь);
		КонецЕсли;
		ОткрытьФорму("Справочник.ЭлементыОписания.ФормаОбъекта", ПараметрыВр, ЭтаФорма);
	ИначеЕсли СтрНайти(ТекПроблема, НСтр("ru='Заголовок без содержимого'")) > 0 Тогда
		ПараметрыВр = Новый Структура("ТекущаяСтрока, Отбор", ТекСсылка, Новый Структура("Владелец", Объект.Ссылка));
		ОткрытьФорму("Справочник.ЭлементыОписания.ФормаСписка", ПараметрыВр, ЭтаФорма);
	ИначеЕсли СтрНайти(ТекПроблема, НСтр("ru='Дубль описания объекта формата'")) > 0 Тогда
		// Дубль, открыть в списке
		ПараметрыВр = Новый Структура("ТекущаяСтрока, Отбор", ТекСсылка, Новый Структура("Владелец", Объект.Ссылка));
		ОткрытьФорму("Справочник.ЭлементыОписания.ФормаСписка", ПараметрыВр, ЭтаФорма);
	Иначе
		// Надо создать заголовок к существующему элементу описания, либо посмотреть текущий заголовок.
		ПараметрыВр = Новый Структура("Ключ, РежимРаботыМастера", ТекСсылка, Истина);
		ОткрытьФорму("Справочник.ЭлементыОписания.ФормаОбъекта", ПараметрыВр, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПоказатьРезультат(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СообщениеДляВыводаПользователю = Новый СообщениеПользователю;
		СообщениеДляВыводаПользователю.Текст = НСтр("ru='Описание не записано'");
		СообщениеДляВыводаПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПоказатьРезультатНаСервере();
	Элементы.ГруппаСтраницыРезультата.ТекущаяСтраница = Элементы.ГруппаРезультатОжидание;
	ИзменитьДоступностьЭлементовФормы(Ложь);
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Описание не записано'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекстРезультат) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Описание не сформировано. Нажмите кнопку Показать результат'"));
		Возврат;
	КонецЕсли;
	
	// Выбор Файла
	ДиалогВыбораФайла				=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Заголовок		=	НСтр("ru='Укажите расположение файла'");
	ДиалогВыбораФайла.Расширение	=	"html";
	ДиалогВыбораФайла.Фильтр		=	"*.html|*.html";


	Если ДиалогВыбораФайла.Выбрать() Тогда
		ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;
	АдресХраненияРезультата = СохранитьВФайлНаСервере();

	ПолучитьФайл(АдресХраненияРезультата, ИмяФайла, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыФорматаБезОписания(Команда)
	ОбъектыФорматаБезОписанияНаСервере();
	Элементы.ОбъектыБезОписанияОтборСправочники.Пометка = Ложь;
	Элементы.ОбъектыБезОписанияОтборДокументы.Пометка = Ложь;
	Элементы.ОбъектыБезОписания.ОтборСтрок = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДокументы(Команда)
	Элементы.ОбъектыБезОписанияОтборДокументы.Пометка = НЕ Элементы.ОбъектыБезОписанияОтборДокументы.Пометка;
	Элементы.ОбъектыБезОписанияОтборСправочники.Пометка = Ложь;
	Если Элементы.ОбъектыБезОписанияОтборДокументы.Пометка Тогда
		Элементы.ОбъектыБезОписания.ОтборСтрок = Новый ФиксированнаяСтруктура("ЭтоДокумент, ТипОбщегоРеквизита", Истина, ПредопределенноеЗначение("Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка"));
	Иначе
		Элементы.ОбъектыБезОписания.ОтборСтрок = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСправочники(Команда)
	Элементы.ОбъектыБезОписанияОтборСправочники.Пометка = НЕ Элементы.ОбъектыБезОписанияОтборСправочники.Пометка;
	Элементы.ОбъектыБезОписанияОтборДокументы.Пометка = Ложь;
	Если Элементы.ОбъектыБезОписанияОтборСправочники.Пометка Тогда
		Элементы.ОбъектыБезОписания.ОтборСтрок = Новый ФиксированнаяСтруктура("ЭтоСправочник, ТипОбщегоРеквизита", Истина, ПредопределенноеЗначение("Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка"));
	Иначе
		Элементы.ОбъектыБезОписания.ОтборСтрок = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьИзСписка(Команда)
	Если Элементы.ОбъектыБезОписания.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.ОбъектыБезОписания.ТекущиеДанные.Скрытый Тогда
		Возврат;
	КонецЕсли;
	Если ПоказыватьСкрытыеОбъектыИзОписанияВСписке Тогда
		ТекСсылка = Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка;
	Иначе
		// надо запомнить ближайший не скрытый объект.
		ИндексТекСтроки = ОбъектыБезОписания.Индекс(Элементы.ОбъектыБезОписания.ТекущиеДанные);
		ТекСсылка = Неопределено;
		Для Ном = ИндексТекСтроки + 1 По ОбъектыБезОписания.Количество()-1 Цикл
			Если Ном < 0 Тогда
				Ном = Ном + 1;
				Продолжить;
			КонецЕсли;
			Если НЕ ОбъектыБезОписания[Ном].Скрытый Тогда
				ТекСсылка = ОбъектыБезОписания[Ном].Ссылка;
				Прервать;
			КонецЕсли;
			Ном = Ном + 1;
		КонецЦикла;
		Если ТекСсылка = Неопределено И ИндексТекСтроки > 1 Тогда
			Ном = ИндексТекСтроки - 1;
			Пока Ном <> 0 Цикл
			Если НЕ ОбъектыБезОписания[Ном].Скрытый Тогда
				ТекСсылка = ОбъектыБезОписания[Ном].Ссылка;
				Прервать;
			КонецЕсли;
			Ном = Ном - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ИзменитьСостояниеОбъектаНаСервере(Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка, Истина);
	Если ТекСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Ссылка", ТекСсылка));
	Если СтрТаб.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ОбъектыБезОписания.ТекущаяСтрока = СтрТаб[0].ПолучитьИдентификатор(); 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытые(Команда)
	Если Элементы.ОбъектыБезОписания.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ Элементы.ОбъектыБезОписания.ТекущиеДанные.Скрытый Тогда
		Возврат;
	КонецЕсли;
	ТекСсылка = Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка;
	ИзменитьСостояниеОбъектаНаСервере(Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка, Ложь);
	СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Ссылка", ТекСсылка));
	Если СтрТаб.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ОбъектыБезОписания.ТекущаяСтрока = СтрТаб[0].ПолучитьИдентификатор(); 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытыеВСписке(Команда)
	ПоказыватьСкрытыеОбъектыИзОписанияВСписке = НЕ ПоказыватьСкрытыеОбъектыИзОписанияВСписке;
	Элементы.ОбъектыБезОписанияПоказатьСкрытыеВСписке.Пометка = ПоказыватьСкрытыеОбъектыИзОписанияВСписке;
	Элементы.ОбъектыБезОписанияКонтекстноеМенюПоказатьСкрытыеВСписке.Пометка = ПоказыватьСкрытыеОбъектыИзОписанияВСписке;
	Если Элементы.ОбъектыБезОписания.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСсылка = Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка;
	ОбъектыФорматаБезОписанияНаСервере();
	ВосстановитьПозициюВСпискеОбъектов(ТекСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьЭлементыОписанийБезЗаголовков(Команда)
	ИскатьЭлементыОписанийБезЗаголовков = НЕ ИскатьЭлементыОписанийБезЗаголовков;
	Элементы.ОбъектыБезОписанияИскатьЭлементыОписанийБезЗаголовков.Пометка = ИскатьЭлементыОписанийБезЗаголовков;
	Если Элементы.ОбъектыБезОписания.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСсылка = Элементы.ОбъектыБезОписания.ТекущиеДанные.Ссылка;
	ОбъектыФорматаБезОписанияНаСервере();
	ВосстановитьПозициюВСпискеОбъектов(ТекСсылка);
КонецПроцедуры

Процедура ВосстановитьПозициюВСпискеОбъектов(ТекСсылка)
	СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Ссылка", ТекСсылка));
	Если СтрТаб.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Элементы.ОбъектыБезОписания.ТекущаяСтрока = СтрТаб[0].ПолучитьИдентификатор(); 
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПоказатьРезультатНаСервере()
	ИдентификаторЗадания = Неопределено;
	ДлительнаяОперация = Ложь;
	АдресХранилищаРезультата = "";
	СтруктураПараметров = Новый Структура("СсылкаНаОписание",Объект.Ссылка);
	Если ЗначениеЗаполнено(ЭлементОписанияОтбор) Тогда
		СтруктураПараметров.Вставить("ЭлементОписанияОтбор", ЭлементОписанияОтбор);
	КонецЕсли;
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование описания формата'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Справочники.Описания.СформироватьДокументОписанияHTML",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		ИзменитьДоступностьЭлементовФормы(Истина);
		Элементы.ГруппаСтраницыРезультата.ТекущаяСтраница = Элементы.ГруппаРезультатОсновная;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При формировании описания формата произошла ошибка'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если НЕ ДлительнаяОперация Тогда
		Элементы.ГруппаСтраницыРезультата.ТекущаяСтраница = Элементы.ГруппаРезультатОсновная;
		ИзменитьДоступностьЭлементовФормы(Истина);
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеФормированияОписания", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	ПрогрессЗадания = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
	Если ПрогрессЗадания = Неопределено Тогда
		ПрогрессЗадания = Новый Структура("Процент, Текст", 0, "");
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции


Процедура ИзменитьДоступностьЭлементовФормы(ФлагДоступность)
	Элементы.СохранитьВФайл.Доступность = ФлагДоступность;
	Элементы.ПоказатьРезультат.Доступность = ФлагДоступность; 
	Элементы.ЭлементОписанияОтбор.Доступность = ФлагДоступность;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеФормированияОписания() 
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	Если РезультатЗагрузки.Успешно Тогда
		ТекстРезультат = РезультатЗагрузки.ТекстРезультат;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Формирование описания не выполнено.'"));
	КонецЕсли;
	Элементы.ГруппаСтраницыРезультата.ТекущаяСтраница = Элементы.ГруппаРезультатОсновная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры


&НаСервере
Функция СохранитьВФайлНаСервере()
	ТХ = Новый ТекстовыйДокумент;
	ТХ.ДобавитьСтроку(ТекстРезультат);
	АдресНаСервере = ПолучитьИмяВременногоФайла("html");
	ТХ.Записать(АдресНаСервере, "windows-1251");
	АдресХранения = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(АдресНаСервере));
	УдалитьФайлы(АдресНаСервере);
	Возврат АдресХранения;
КонецФункции

&НаСервере
Процедура ОбъектыФорматаБезОписанияНаСервере()
	Запрос = ЗапросОбъектыБезОписания();
	Выборка = Запрос.Выполнить().Выбрать();
	ОбъектыБезОписания.Очистить();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ОбъектыБезОписания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Проблема = "Объект без описания";
		Если СтрНайти(Выборка.Наименование, "Справочник.") <> 0 Тогда
			НовСтрока.ЭтоСправочник = Истина;
		ИначеЕсли СтрНайти(Выборка.Наименование, "Документ.") <> 0 Тогда
			НовСтрока.ЭтоДокумент = Истина;
		КонецЕсли;
	КонецЦикла;
	Запрос = ЗапросТипыБезОписания();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ОбъектыБезОписания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Проблема = "Тип без описания";
	КонецЦикла;
	Запрос = ЗапросЗаголовокБезСодержимого();
	// Заголовки внутри которых нет описаний объектов.
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ОбъектыБезОписания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Проблема = "Заголовок без содержимого";
	КонецЦикла;
	// Дубли элементов описаний для объектов формата.
	Запрос = ЗапросДублиОбъектовФормата();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ОбъектыБезОписания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Проблема = "Дубль описания объекта формата";
	КонецЦикла;
	// Объекты без заголовков.
	Если НЕ ИскатьЭлементыОписанийБезЗаголовков Тогда
		Возврат;
	КонецЕсли;
	Запрос = ЗапросОписаниеБезЗаголовка();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ОбъектыБезОписания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.Проблема = "Описание объекта без отдельного заголовка";
		Если СтрНайти(Выборка.Наименование, "Справочник.") <> 0 Тогда
			НовСтрока.ЭтоСправочник = Истина;
		ИначеЕсли СтрНайти(Выборка.Наименование, "Документ.") <> 0 Тогда
			НовСтрока.ЭтоДокумент = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗапросОбъектыБезОписания(ФильтрОбъект = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Объекты.Ссылка КАК Ссылка,
	|	Объекты.Наименование,
	|	Объекты.ТипОбщегоРеквизита КАК ТипОбщегоРеквизита,
	|	ВЫБОР КОГДА СкрытыеОбъекты.ОбъектОписания Is NULL ТОГДА ЛОЖЬ ИНАЧЕ Истина КОНЕЦ КАК Скрытый
	|ИЗ Справочник.ОбъектыФормата КАК Объекты
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыОписания КАК ЭлементыСтар
	|ПО Объекты.Наименование = ЭлементыСтар.ОбъектФормата И ЭлементыСтар.Владелец = &Описание 
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата КАК Свойства
	|ПО Свойства.Владелец = Объекты.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкрытыеОбъектыФормата КАК СкрытыеОбъекты
	|	ПО СкрытыеОбъекты.Описание = &Описание И СкрытыеОбъекты.ОбъектОписания = Объекты.Ссылка
	|ГДЕ Объекты.Владелец = &ВерсияФормата #ФильтрОбъект#
	|	И ЭлементыСтар.Ссылка IS NULL
	|	И (
	|	Объекты.ТипОбщегоРеквизита = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка)
	|	ИЛИ Объекты.ТипОбщегоРеквизита = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ГруппаОбщихСвойств)
	|	ИЛИ Объекты.ТипОбщегоРеквизита = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть)
	|	)
	|	И Объекты.ЭтоГруппаОбщихСвойств = ЛОЖЬ
	|	И (&ПоказыватьСкрытые = Истина ИЛИ СкрытыеОбъекты.ОбъектОписания Is NULL)
	|УПОРЯДОЧИТЬ ПО Объекты.Наименование";
	Запрос.УстановитьПараметр("ВерсияФормата", Справочники.ВерсииФормата.НайтиПоНаименованию(Объект.НомерВерсииФормата));
	Запрос.УстановитьПараметр("Описание", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПоказыватьСкрытые", ПоказыватьСкрытыеОбъектыИзОписанияВСписке);
	Если ФильтрОбъект = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрОбъект#", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрОбъект#", "И Объекты.Ссылка = &ФильтрОбъект");
		Запрос.УстановитьПараметр("ФильтрОбъект", ФильтрОбъект);
	КонецЕсли;
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ЗапросЗаголовокБезСодержимого(ФильтрЭлементОписания = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭлементыЗаголовки.Ссылка КАК Ссылка, 
	|	ЭлементыЗаголовки.Наименование КАК Наименование,
	|	ВЫБОР КОГДА СкрытыеОбъекты.ОбъектОписания Is NULL ТОГДА ЛОЖЬ ИНАЧЕ Истина КОНЕЦ КАК Скрытый
	|ИЗ Справочник.ЭлементыОписания КАК ЭлементыЗаголовки
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.ЭлементыОписания КАК ЭлементыПодчиненные
	|ПО ЭлементыПодчиненные.Родитель = ЭлементыЗаголовки.Ссылка И ЭлементыПодчиненные.Владелец = &Описание
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкрытыеОбъектыФормата КАК СкрытыеОбъекты
	|	ПО СкрытыеОбъекты.Описание = &Описание И СкрытыеОбъекты.ОбъектОписания = ЭлементыЗаголовки.Ссылка
	|ГДЕ ЭлементыЗаголовки.Владелец = &Описание #ФильтрЭлементОписания#
	|	И ЭлементыЗаголовки.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.Заголовок)
	|	И ЭлементыПодчиненные.Ссылка is null
	|	И (&ПоказыватьСкрытые = Истина ИЛИ СкрытыеОбъекты.ОбъектОписания Is NULL)
	|	И НЕ ЭлементыЗаголовки.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО ЭлементыЗаголовки.Наименование";
	Запрос.УстановитьПараметр("Описание", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПоказыватьСкрытые", ПоказыватьСкрытыеОбъектыИзОписанияВСписке);
	Если ФильтрЭлементОписания = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрЭлементОписания#", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрЭлементОписания#", "И ЭлементыЗаголовки.Ссылка = &ФильтрЭлементОписания");
		Запрос.УстановитьПараметр("ФильтрЭлементОписания", ФильтрЭлементОписания);
	КонецЕсли;
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ЗапросДублиОбъектовФормата(ФильтрЭлементОписания = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭлементыОписаниеФормата.Ссылка КАК Ссылка, 
	|	ЭлементыОписаниеФормата.Наименование КАК Наименование,
	|	ВЫБОР КОГДА СкрытыеОбъекты.ОбъектОписания Is NULL ТОГДА ЛОЖЬ ИНАЧЕ Истина КОНЕЦ КАК Скрытый
	|ИЗ Справочник.ЭлементыОписания КАК ЭлементыОписаниеФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.ЭлементыОписания КАК ЭлементыДублирующие
	|ПО ЭлементыДублирующие.ОбъектФормата = ЭлементыОписаниеФормата.ОбъектФормата И ЭлементыДублирующие.Владелец = &Описание
	|	И ЭлементыДублирующие.Ссылка <> ЭлементыОписаниеФормата.Ссылка
	|	И ЭлементыДублирующие.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата)
	|	И НЕ ЭлементыДублирующие.ПометкаУдаления
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкрытыеОбъектыФормата КАК СкрытыеОбъекты
	|	ПО СкрытыеОбъекты.Описание = &Описание И СкрытыеОбъекты.ОбъектОписания = ЭлементыОписаниеФормата.Ссылка
	|ГДЕ ЭлементыОписаниеФормата.Владелец = &Описание #ФильтрЭлементОписания#
	|	И ЭлементыОписаниеФормата.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата)
	|	И НЕ ЭлементыОписаниеФормата.ПометкаУдаления
	|	И ЭлементыДублирующие.Ссылка is not null
	|УПОРЯДОЧИТЬ ПО ЭлементыОписаниеФормата.Наименование"; 
	Запрос.УстановитьПараметр("Описание", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПоказыватьСкрытые", ПоказыватьСкрытыеОбъектыИзОписанияВСписке);
	Если ФильтрЭлементОписания = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрЭлементОписания#", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрЭлементОписания#", "И ЭлементыОписаниеФормата.Ссылка = &ФильтрЭлементОписания");
		Запрос.УстановитьПараметр("ФильтрЭлементОписания", ФильтрЭлементОписания);
	КонецЕсли;
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ЗапросОписаниеБезЗаголовка(ФильтрЭлементОписания = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭлементыОписаниеОбъекта.Ссылка КАК Ссылка,
	|	ОбъектыФормата.ТипОбщегоРеквизита КАК ТипОбщегоРеквизита,
	|	ОбъектыФормата.Наименование КАК Наименование,
	|	ВЫБОР КОГДА СкрытыеОбъекты.ОбъектОписания Is NULL ТОГДА ЛОЖЬ ИНАЧЕ Истина КОНЕЦ КАК Скрытый
	|ИЗ Справочник.ЭлементыОписания КАК ЭлементыОписаниеОбъекта
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.ЭлементыОписания КАК ЭлементыВышестоящие
	|ПО ЭлементыОписаниеОбъекта.Родитель = ЭлементыВышестоящие.Ссылка И ЭлементыВышестоящие.Владелец = &Описание
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ЭлементыОписания КАК ЭлементыПодчиненныеРодителю
	|ПО ЭлементыПодчиненныеРодителю.Владелец = &Описание И ЭлементыПодчиненныеРодителю.Родитель = ЭлементыВышестоящие.Ссылка
	|	И ЭлементыПодчиненныеРодителю.Ссылка <> ЭлементыОписаниеОбъекта.Ссылка
	|	И ЭлементыПодчиненныеРодителю.ТипЭлемента <> ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ПростойТекст)
	|	И ЭлементыПодчиненныеРодителю.ТипЭлемента <> ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.Заголовок)
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкрытыеОбъектыФормата КАК СкрытыеОбъекты
	|	ПО СкрытыеОбъекты.Описание = &Описание И СкрытыеОбъекты.ОбъектОписания = ЭлементыОписаниеОбъекта.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|ПО ОбъектыФормата.Владелец = &ВерсияФормата И ОбъектыФормата.Наименование = ЭлементыОписаниеОбъекта.ОбъектФормата
	|ГДЕ ЭлементыОписаниеОбъекта.Владелец = &Описание #ФильтрЭлементОписания#
	|	И ЭлементыОписаниеОбъекта.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата)
	|	И (ЭлементыВышестоящие.Ссылка is null Или ЭлементыПодчиненныеРодителю.Ссылка is not null)
	|	И (&ПоказыватьСкрытые = Истина ИЛИ СкрытыеОбъекты.ОбъектОписания Is NULL)
	|	И НЕ ЭлементыОписаниеОбъекта.ПометкаУдаления
	|	И НЕ ЭлементыПодчиненныеРодителю.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО ЭлементыОписаниеОбъекта.Наименование";
	Запрос.УстановитьПараметр("Описание", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВерсияФормата", Справочники.ВерсииФормата.НайтиПоНаименованию(Объект.НомерВерсииФормата));
	Запрос.УстановитьПараметр("ПоказыватьСкрытые", ПоказыватьСкрытыеОбъектыИзОписанияВСписке);
	Если ФильтрЭлементОписания = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрЭлементОписания#", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ФильтрЭлементОписания#", "И ЭлементыОписаниеОбъекта.Ссылка = &ФильтрЭлементОписания");
		Запрос.УстановитьПараметр("ФильтрЭлементОписания", ФильтрЭлементОписания);
	КонецЕсли;
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ЗапросТипыБезОписания()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТипыФормата.Ссылка,
	|	ВЫБОР КОГДА СкрытыеОбъекты.ОбъектОписания Is NULL ТОГДА ЛОЖЬ ИНАЧЕ Истина КОНЕЦ КАК Скрытый
	|ИЗ Справочник.ТипыФормата КАК ТипыФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыОписания.ОписанияТипов КАК ОписанияТипов
	|ПО ТипыФормата.Ссылка = ОписанияТипов.Тип
	|	И ОписанияТипов.Ссылка.Владелец = &Описание
	|	И ОписанияТипов.Ссылка.ПометкаУдаления = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкрытыеОбъектыФормата КАК СкрытыеОбъекты
	|	ПО СкрытыеОбъекты.Описание = &Описание И СкрытыеОбъекты.ОбъектОписания = ТипыФормата.Ссылка
	|ГДЕ ТипыФормата.Владелец = &ВерсияФормата И ОписанияТипов.Ссылка is null
	|	И (&ПоказыватьСкрытые = Истина ИЛИ СкрытыеОбъекты.ОбъектОписания Is NULL)
	|";
	Запрос.УстановитьПараметр("Описание", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВерсияФормата", Справочники.ВерсииФормата.НайтиПоНаименованию(Объект.НомерВерсииФормата));
	Запрос.УстановитьПараметр("ПоказыватьСкрытые", ПоказыватьСкрытыеОбъектыИзОписанияВСписке);
	Возврат Запрос;
КонецФункции

&НаСервере
Процедура ИзменитьСостояниеОбъектаНаСервере(ОбъектОписания, СкрытьИзСписка)
	РегистрОбъектыСкрытые = РегистрыСведений.СкрытыеОбъектыФормата.СоздатьНаборЗаписей();
	РегистрОбъектыСкрытые.Отбор.Описание.Установить(Объект.Ссылка);
	РегистрОбъектыСкрытые.Отбор.ОбъектОписания.Установить(ОбъектОписания);
	Если СкрытьИзСписка Тогда
		НовЗапись = РегистрОбъектыСкрытые.Добавить();
		НовЗапись.Описание = Объект.Ссылка;
		НовЗапись.ОбъектОписания = ОбъектОписания;
	КонецЕсли;
	РегистрОбъектыСкрытые.Записать(Истина);
	ОбъектыФорматаБезОписанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписьЭлементаОписания(Параметр)
	ОбъектФорматаСсылка = Неопределено;
	ЭлементСсылка = Параметр.ЭлементОписания;
	СтрТаб = Неопределено;
	Если Параметр.Свойство("ОбъектФормата", ОбъектФорматаСсылка) Тогда
		Запрос = ЗапросОбъектыБезОписания(ОбъектФорматаСсылка);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Ссылка, Проблема", ОбъектФорматаСсылка, "Объект без описания"));
			УдалитьСтрокиТаблицыПроблемныхОбъектов(СтрТаб);
		КонецЕсли;
	КонецЕсли;
	Если ЭлементСсылка.ТипЭлемента = Перечисления.ТипыЭлементовОписания.Типы Тогда
		СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Проблема", "Тип без описания"));
		Если СтрТаб.Количество() > 0 Тогда
			УдалитьСтрокиТаблицыПроблемныхОбъектов(СтрТаб);
		КонецЕсли;
		Запрос = ЗапросТипыБезОписания();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтрока = ОбъектыБезОписания.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
			НовСтрока.Проблема = "Тип без описания";
		КонецЦикла;
	КонецЕсли;
	Запрос = ЗапросЗаголовокБезСодержимого(ЭлементСсылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Ссылка, Проблема", ЭлементСсылка, "Заголовок без содержимого"));
		УдалитьСтрокиТаблицыПроблемныхОбъектов(СтрТаб);
	КонецЕсли;
	Запрос = ЗапросДублиОбъектовФормата(ЭлементСсылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Ссылка, Проблема", ЭлементСсылка, "Дубль описания объекта формата"));
		УдалитьСтрокиТаблицыПроблемныхОбъектов(СтрТаб);
	КонецЕсли;
	Запрос = ЗапросОписаниеБезЗаголовка(ЭлементСсылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		СтрТаб = ОбъектыБезОписания.НайтиСтроки(Новый Структура("Ссылка, Проблема", ЭлементСсылка, "Описание объекта без отдельного заголовка")); 
		УдалитьСтрокиТаблицыПроблемныхОбъектов(СтрТаб);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьСтрокиТаблицыПроблемныхОбъектов(СтрТаб)
	Если СтрТаб.Количество() > 0 Тогда
		Для Каждого СтрокаТаб Из СтрТаб Цикл
			ОбъектыБезОписания.Удалить(ОбъектыБезОписания.Индекс(СтрокаТаб));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиЭлементОписанияДляТипов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.ЭлементыОписания
	|ГДЕ ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.Типы)
	|	И ПометкаУдаления = Ложь И Владелец = &Описание";
	Запрос.УстановитьПараметр("Описание", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ссылка;
	КонецЕсли;
КонецФункции

#КонецОбласти
